[
  {
    "name": "Shrek",
    "content": "Shrek is a 2001 American computer-animated comedy film loosely based on the 1990 fairytale picture book of the same name by William Steig. Directed by Andrew Adamson and Vicky Jenson in their directorial debuts, it stars Mike Myers, Eddie Murphy, Cameron Diaz, and John Lithgow as the voices of the lead characters. The film parodies other films adapted from fairy tale storylines, primarily aimed at animated Disney films. In the story, an ogre called Shrek (Myers) finds his swamp overrun by fairy tale creatures who have been banished by the corrupt Lord Farquaad (Lithgow) aspiring to be king. Shrek makes a deal with Farquaad to regain control of his swamp in return for rescuing Princess Fiona (Diaz), whom Farquaad intends to marry. With the help of Donkey (Murphy), Shrek embarks on his quest but soon falls in love with the princess, who is hiding a secret that will change his life forever."
  },
  {
    "name": "Good Will Hunting",
    "content": "Unequivocally one of the most important movies in cinema history. I'm of the opinion that this is the movie that is imperative to watch at least once in your lifetime, as it teaches some incredibly influential lessons that are fabulously presented by actors like Robin Williams, rest his soul, Matt Damon and Ben Affleck. This movie is in the genre that are the most important for one to watch, because they are movies about people. Relationships, insecurities, childhood trauma, but most of all - development. "
  },
  {
    "name": "Fight Club",
    "content": "Looks like we're going to break the first two rules of Fight Club. Over the last twenty years, Fight Club has been considered to be one of the most controversial and talked-about movies of all time and developed a cult following. It received polarizing reviews at the time and was a box-office failure, but soon found commercial success thanks to its DVD sales and the movie's themes managed to remain relevant even today."
  },
  {
    "name": "Lego Movie",
    "content": "Everything is awesome!"
  }
]
